src_ext/Catalogs/УЗ_Абонемент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Абонемент</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗанятий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаАбонемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приостановки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПриостановки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозобновления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЯвок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Явка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Catalogs/УЗ_Абонемент/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗаполнитьТЗОплат();

	ОбновитьВидимость();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЧасыТекстом = УЗ_ОбщийКлиентСервер.ЧасыМинуты(Объект.КоличествоЧасов, Истина);
	//В12: организация абонемента — только если в базе есть организации (как в форме урока)
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 Организации.Ссылка КАК Ссылка ИЗ Справочник.Организации КАК Организации");
	Элементы.Организация.Видимость = Не Запрос.Выполнить().Пустой();

	Если Объект.Ссылка.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.Тариф) И ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
			Объект.Тариф = Объект.ФизЛицо.Тариф;
		КонецЕсли;
		//новый абонемент — на месяц с сегодняшнего дня (период можно поправить)
		Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
			Объект.ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
			Объект.ДатаОкончания = ДобавитьМесяц(Объект.ДатаНачала, 1) - 86400;
		КонецЕсли;
		ЗаполнитьПоТарифу(Ложь);
		ОбновитьАвтоНаименование();
	Иначе
		ПоследнееАвтоНаименование =
			Справочники.УЗ_Абонемент.АвтоНаименование(Объект.ФизЛицо, Объект.ДатаНачала, Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

//После записи оплаты или урока по этому абонементу — пересчитать «Оплачено» и остаток без F5.
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_УЗ_ПриходДенег" Или ИмяСобытия = "ЗакрытьФормуУрока" Тогда
		ЗаполнитьТЗОплат();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
	ОбновитьАвтоНаименованиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОплаченоНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере(Объект.Ссылка);
	ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	ФизЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТарифПриИзменении(Элемент)
	ТарифПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИтогоПосещенийНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере(Объект.Ссылка);
	ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧасовПриИзменении(Элемент)
	//часы вводятся строкой «ч:мм» (реквизит формы ЧасыТекстом), хранятся числом часов
	Часы = УЗ_ОбщийКлиентСервер.ЧасыИзСтроки(ЧасыТекстом);
	Если Часы = Неопределено Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'Часы вводятся как ч:мм, например 1:30.'"), "ЧасыТекстом");
	Иначе
		Объект.КоличествоЧасов = Часы;
		Объект.КоличествоЗанятий = 0;
	КонецЕсли;
	ЧасыТекстом = УЗ_ОбщийКлиентСервер.ЧасыМинуты(Объект.КоличествоЧасов, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗанятийПриИзменении(Элемент)
	Объект.КоличествоЧасов = 0;
	ЧасыТекстом = "";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПриостановки

&НаКлиенте
Процедура ПриостановкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Активировать(Команда)

	Объект.Активный = НЕ Объект.Активный;

	Если Объект.Активный Тогда
		Объект.ДатаАктивации = УЗ_Сервер.ДатаСеанса();	//время сервера, а не компьютера пользователя (Codex Т2)
	КонецЕсли;

	ОбновитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура Приостановить(Команда)

	Если Объект.Активный Тогда
		ОП = Новый ОписаниеОповещения("ЗапросДнейПриостановки",ЭтотОбъект);
		ОткрытьФорму("Справочник.УЗ_Абонемент.Форма.ФормаПриостановки",,ЭтотОбъект,,,,ОП,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

	ОбновитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФизЛицо(Команда)
	Элементы.ФизЛицо.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериод(Команда)
	Элементы.Группа8.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦенуАбонемента(Команда)
	Элементы.ЦенаАбонемента.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьТЗОплат();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапросДнейПриостановки(Результат,Параметры) Экспорт

	//окно закрыли крестиком или «Отмена» — Результат Неопределено, приостановку не добавляем
	Если ТипЗнч(Результат) = Тип("Структура") И ЗначениеЗаполнено(Результат.ПериодПриостановки.ДатаНачала) Тогда

		ПериодПриостановки = Результат.ПериодПриостановки;

		//та же проверка, что при записи абонемента (срок с продлением — В4, проведённые уроки — В17); пустое «по» —
		//бессрочная приостановка (З-3)
		ТекстОшибки = ДобавитьПриостановкуНаСервере(ПериодПриостановки.ДатаНачала, ПериодПриостановки.ДатаОкончания,
			Результат.Причина);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка в датах приостановки: " + ТекстОшибки;
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;

		Попытка
			Записать();
		Исключение
			Сообщить(""+ОписаниеОшибки())
		КонецПопытки;

	КонецЕсли;

	ОбновитьВидимость();

КонецПроцедуры

//Строка приостановки из окна «Приостановить»: последний день паузы → дата возобновления (следующий день), пустой —
//бессрочно; проверка — та же, что при записи абонемента. Возврат: текст ошибки или "" (строка добавлена).
&НаСервере
Функция ДобавитьПриостановкуНаСервере(ДатаПриостановки, ПоследнийДень, Причина)

	ДатаВозобновления = Справочники.УЗ_Абонемент.ВозобновлениеПоПоследнемуДню(ПоследнийДень);
	ТекстОшибки = Справочники.УЗ_Абонемент.ОшибкаПриостановки(Объект, ДатаПриостановки, ДатаВозобновления);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	НовСтр = Объект.Приостановки.Добавить();
	НовСтр.ДатаИзменения 		= ТекущаяДатаСеанса();
	НовСтр.ДатаПриостановки 	= НачалоДня(ДатаПриостановки);
	НовСтр.ДатаВозобновления 	= ДатаВозобновления;
	НовСтр.Комментарий 			= Причина;
	Возврат "";

КонецФункции

&НаКлиенте
Процедура ОбновитьВидимость()

	Если Объект.Ссылка.Пустая() Тогда
		Элементы.ФизЛицо.ТолькоПросмотр 		= Ложь;
		Элементы.Группа8.ТолькоПросмотр 		= Ложь;
		Элементы.ЦенаАбонемента.ТолькоПросмотр 	= Ложь;
	Иначе
		Элементы.ФизЛицо.ТолькоПросмотр 		= Истина;
		Элементы.Группа8.ТолькоПросмотр 		= Истина;
		Элементы.ЦенаАбонемента.ТолькоПросмотр 	= Истина;
	КонецЕсли;

	Период.ДатаНачала 	 = Объект.ДатаНачала;
	Период.ДатаОкончания = Объект.ДатаОкончания;

	Если Объект.Активный Тогда

		Элементы.Приостановить.Доступность 		= Истина;

		Элементы.Активировать.Заголовок 		= "Сделать неактивным";

		//состояние и срок с продлением на дни приостановок — теми же функциями, что у урока (В4)
		Состояние = СостояниеАбонемента();
		Если Состояние.Приостановлен Тогда
			Элементы.ДекорацияСтатус.Заголовок 		= ?(ЗначениеЗаполнено(Состояние.ДатаВозобновления),
				"Приостановлен до " + Формат(Состояние.ДатаВозобновления, "ДФ=dd.MM.yyyy"), "Приостановлен");
			Элементы.ДекорацияСтатус.ЦветТекста 	= УЗ_ОбщийКлиентСервер.ЦветМинусаДенег();
		Иначе
			Элементы.ДекорацияСтатус.Заголовок 		= "Активен на " + Формат(Состояние.НаДату, "ДФ=dd.MM.yyyy");
			Элементы.ДекорацияСтатус.ЦветТекста 	= УЗ_ОбщийКлиентСервер.ЦветПлюсаДенег();
		КонецЕсли;
		Если Состояние.ДнейПриостановки > 0 И ЗначениеЗаполнено(Состояние.Срок) Тогда
			Элементы.ДекорацияСтатус.Заголовок = Элементы.ДекорацияСтатус.Заголовок + ", срок до "
				+ Формат(Состояние.Срок, "ДФ=dd.MM.yyyy") + " (продлён на " + Состояние.ДнейПриостановки
					+ " дн. приостановки)";
		КонецЕсли;
	Иначе
		Элементы.Активировать.Заголовок 		= "Активировать";
		Элементы.ДекорацияСтатус.Заголовок 		= "Неактивен";
		Элементы.ДекорацияСтатус.ЦветТекста 	= УЗ_ОбщийКлиентСервер.ЦветПояснения();
		Элементы.Приостановить.Доступность 		= Ложь;
	КонецЕсли;

	Элементы.Группа7.Заголовок = "Список приостановок (" +Объект.Приостановки.Количество()+ ")";

	ПоказатьФото();

КонецПроцедуры

&НаСервере
Функция СостояниеАбонемента()
	//НаДату — дата сервера, на которую посчитано состояние: «Активен на …» показывает её, а не часы компьютера
	НаДату = ТекущаяДатаСеанса();
	Состояние = Справочники.УЗ_Абонемент.СостояниеАбонемента(Объект, НаДату);
	Состояние.Вставить("НаДату", НаДату);
	Возврат Состояние;
КонецФункции

Процедура ЗаполнитьТЗОплат()

	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;

	Оплачено 		= 0;
	Израсходовано 	= 0;
	Остаток 		= 0;
	ИтогоЧасов 		= "";
	ИтогоЧасовПоЯвкам = "";
	Элементы.Декорация3.Заголовок = "";
	//остаток — тем же текстом, что форма урока, помощник и панель ученика («7 из 8 зан.», «1,33 из 2 ч»)
	ОстатокУроковЧасов = Справочники.УЗ_Абонемент.ТекстОстатка(Объект.Ссылка);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.СуммаКонечныйОстаток КАК Остаток,
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.Регистратор КАК Документ,
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.ПериодСекунда КАК Дата,
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.СуммаОборот КАК Сумма,
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.Клиент КАК Ученик,
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.ЧасыРасход / 60 / 60 КАК ЧасыРасход,
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.КоличествоЯвокОборот КАК Явок,
		|	УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.КоличествоУроковОборот КАК Уроков,
		|	ВЫБОР
		|		КОГДА УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.КоличествоЯвокОборот <> 0
		|			ТОГДА УЗ_СписанияСуммЗаУрокиОстаткиИОбороты.ЧасыРасход / 60 / 60
		|	КОНЕЦ КАК ЧасыРасходПоЯвкам
		|ИЗ
		|	РегистрНакопления.УЗ_СписанияСуммЗаУроки.ОстаткиИОбороты(, , Авто, , Абонемент = &Абонемент) КАК
		|		УЗ_СписанияСуммЗаУрокиОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ученик,
		|	Дата
		|АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.УстановитьПараметр("Абонемент", Объект.Ссылка);
	//Запрос.УстановитьПараметр("ДатаНачала", '00010101');  //Объект.ДатаНачала
	//Запрос.УстановитьПараметр("ДатаОкончания", '20990101'); //Объект.ДатаОкончания

	Попытка
		ВремТЗ = Запрос.Выполнить().Выгрузить();

		Если ВремТЗ.Количество()<> 0 Тогда
			//R13 (ревью 28.09): «Оплачено» — приход минус возвраты, одна функция с приходом денег по абонементу
			Оплата = Справочники.УЗ_Абонемент.ОплатаАбонемента(Объект.Ссылка);
			Оплачено 		= Оплата.Оплачено;
			Израсходовано 	= Оплата.Израсходовано;
			Остаток 		= Оплата.Остаток;
			ИтогоЧасов 		= УЗ_ОбщийКлиентСервер.ЧасыМинуты(ВремТЗ.Итог("ЧасыРасход"));
			ИтогоУроков		= ВремТЗ.Итог("Уроков");
			ИтогоЯвок		= ВремТЗ.Итог("Явок");
			ИтогоЧасовПоЯвкам = УЗ_ОбщийКлиентСервер.ЧасыМинуты(ВремТЗ.Итог("ЧасыРасходПоЯвкам"));

			Если Оплата.ОплаченПолностью Тогда
				Элементы.Декорация3.Заголовок = "(Оплачен полностью)";
				Элементы.Декорация3.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветПлюсаДенег();
			ИначеЕсли Оплата.ОсталосьОплатить > 0 Тогда
				Элементы.Декорация3.Заголовок = "(Осталось оплатить " +Формат(Оплата.ОсталосьОплатить,"ЧДЦ=2")+")";
				Элементы.Декорация3.ЦветТекста = УЗ_ОбщийКлиентСервер.ЦветПояснения();
			КонецЕсли;

		КонецЕсли;

		ТЗОплат.Загрузить(ВремТЗ);
		//часы — строкой «ч:мм» (в таблице и в итогах часов больше суток)
		Для Каждого Стр Из ТЗОплат Цикл
			Стр.ЧасыТекстом = УЗ_ОбщийКлиентСервер.ЧасыМинуты(Стр.ЧасыРасход, Истина);
			Стр.ЧасыПоЯвкамТекстом = УЗ_ОбщийКлиентСервер.ЧасыМинуты(Стр.ЧасыРасходПоЯвкам, Истина);
		КонецЦикла;

	Исключение
		УЗ_Общий.ЗаписатьОшибку("Абонемент.Оплаты", ИнформацияОбОшибке(),
			НСтр("ru = \'Не удалось посчитать оплаты абонемента\'"));
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ОбновитьАвтоНаименованиеНаСервере()
	ОбновитьАвтоНаименование();
КонецПроцедуры

&НаСервере
Функция ОткрытьВзаиморасчетыНаСервере(Значение)

	Возврат УЗ_Общий.ПараметрыОткрытияОтчета("УЗ_Взаиморасчеты", Новый Структура("Абонемент", Значение));
КонецФункции

&НаСервере
Процедура ФизЛицоПриИзмененииНаСервере()
	//тариф ученика — в новый абонемент, если тариф ещё не выбран
	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Тариф) И ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		Объект.Тариф = Объект.ФизЛицо.Тариф;
		ЗаполнитьПоТарифу(Ложь);
	КонецЕсли;
	ОбновитьАвтоНаименование();
	ПоказатьФото();
КонецПроцедуры

//Уроки, часы и цена из тарифа. Перезаписать = Ложь — заполняются только пустые.
&НаСервере
Процедура ЗаполнитьПоТарифу(Перезаписать)

	Значения = Справочники.УЗ_Абонемент.ЗначенияПоТарифу(Объект.Тариф, Объект.ДатаНачала);
	Если Значения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Перезаписать Или (Объект.КоличествоЗанятий = 0 И Объект.КоличествоЧасов = 0) Тогда
		Объект.КоличествоЗанятий = Значения.КоличествоУроков;
		Объект.КоличествоЧасов = ?(Значения.КоличествоУроков > 0, 0, Значения.КоличествоЧасов);
		ЧасыТекстом = УЗ_ОбщийКлиентСервер.ЧасыМинуты(Объект.КоличествоЧасов, Истина);
	КонецЕсли;
	Если Перезаписать Или Объект.ЦенаАбонемента = 0 Тогда
		Объект.ЦенаАбонемента = Значения.Сумма;
	КонецЕсли;

КонецПроцедуры

//Наименование составляется само, пока его не поправили руками.
&НаСервере
Процедура ОбновитьАвтоНаименование()

	Если ПустаяСтрока(Объект.Наименование) Или Объект.Наименование = ПоследнееАвтоНаименование Тогда
		Объект.Наименование =
			Справочники.УЗ_Абонемент.АвтоНаименование(Объект.ФизЛицо, Объект.ДатаНачала, Объект.Ссылка);
	КонецЕсли;
	ПоследнееАвтоНаименование = Объект.Наименование;

КонецПроцедуры

&НаСервере
Процедура ТарифПриИзмененииНаСервере()
	//у записанного абонемента уроки и цена закрыты кнопками «Изменить» — там не перезаписываем
	ЗаполнитьПоТарифу(Объект.Ссылка.Пустая());
КонецПроцедуры

&НаСервере
Процедура ПоказатьФото()
	Фото = ?(Объект.ФизЛицо.Пустая(), "", УЗ_Общий.АдресФото(Объект.ФизЛицо.Фото));
	//нет фото — нет и пустой рамки на пол-экрана
	Элементы.Фото.Видимость = ЗначениеЗаполнено(Фото);
КонецПроцедуры

#КонецОбласти
